const promotions = [
    {
      id: 1,
      title: "Long-Stay Hotel– скидки 10%",
      description: "Для тех, кто любит долгие поездки. Решили остановиться у нас надолго? Для вас специальное предложение на размещение. Пусть Гостиничный комплекс Электросталь навсегда останется в вашей памяти!",
      conditions: [
        "Предложение действует при бронировании от 7-ми суток",
        "В случае фактического проживания менее 7-ми ночей делается перерасчет стоимости проживания исходя из действующей цены за выбранный номер без скидки",
        "Не суммируется с другими акциями"
      ],
      image: "/images/promotions/1.jpg",
      link: "#"
    },
    {
      id: 2,
      title: "Рабочие выходные в отеле",
      description: "Приехали по делам? Мы будем рады встретить Вас! \n При бронировании номера на 3 ночи с четверга по воскресенье предоставляется скидка 10% от стоимости проживания.",
      conditions: [
        "Скидка 10% предоставляется при условии предварительного бронирования с четверга по воскресенье",
        "Не суммируется с другими акциями"
      ],
      image: "/images/promotions/2.jpg",
      link: "#"
    },
    {
      id: 3,
      title: "Подарок в день рождения",
      description: "Устройте незабываемый праздник в Гостиничном комплексе Электросталь! Развитая инфраструктура, несколько вариантов проживания открывают широкие возможности для организации вашего праздника. \n Именинникам мы дарим комплименты и скидку на проживание 15%. Выбирайте для своего торжества лучшее!",
      conditions: [
        "Скидка предоставляется при условии предварительного бронирования за 7 дней до дня рождения и 7 дней после него",
        "Не суммируется с другими акциями"
      ],
      image: "/images/promotions/3.jpg",
      link: "#"
    },
    {
      id: 4,
      title: "Полупансион с завтраком и ужином",
      description: "Не забудьте добавить в свое путешествие комплексные завтраки и ужины! \n Наше уютное кафе расположилось на первом этаже гостиничного комплекса. Мы приглашаем Вас попробовать вкуснейшие блюда европейской кухни, а также разнообразные безалкогольные напитки. ",
      conditions: [],
      image: "/images/promotions/4.jpg",
      link: "#"
    },
    {
      id: 5,
      title: "Дети до 12 лет отдыхают бесплатно",
      description: "Путешествие дарит ребёнку массу положительных эмоций и ярких впечатлений. Даже непродолжительную поездку в соседний город ребёнок воспринимает как захватывающее приключение. Смена привычной обстановки благотворно влияет на маленьких путешественников, способствует расширению кругозора и получению новых знаний о мире. \nГостиница Электросталь стремится сделать путешествие с детьми максимально комфортным. Мы бесплатно размещаем детей до 12 лет в номерах с родителями.",
      conditions: [],
      image: "/images/promotions/5.jpg",
      link: "#"
    }
  ];

  
  export default promotions;