const services = [
    {
      id: 1,
      title: "Кафетерий 24/7 с полным пансионом",
      description: "Кафетерий отеля представляет собой уютное пространство, оформленное в современном минималистичном стиле. Вы можете заказать полноценные завтраки, обеды или ужины через ресепшн отеля.",
      image: "/images/services/1.jpg",
      link: "/services/cafeteria"
    },
    {
      id: 2,
      title: "Экопарк «Авангард» напротив отеля",
      description: "Экопарк Авангард – одно из лучших мест для отдыха в городе Электросталь. На территории расположились пешеходные и велосипедные дорожки, игровые и спортивные площадки, а также площадка для выгула собак.",
      image: "/images/services/2.jpg",
      link: "/services/eco-park"
    },
    {
      id: 3,
      title: "Прачечная",
      description: "Часто случается так, что во время поездки у отдыхающих «заканчиваются» чистые вещи. И если вы остановились в отеле, стирать их приходится вручную, что отнимает время, силы и нервы. Благо, гости Гостиничного комплекса Электросталь могут воспользоваться прачечной.",
      image: "/images/services/3.jpg",
      link: "/services/laundry"
    },
    {
      id: 4,
      title: "Бесплатная парковка",
      description: "Для гостей Гостиничного комплекса Электросталь на закрытой территории гостиницы работает стоянка, где машина будет находится под круглосуточным наблюдением!",
      image: "/images/services/4.jpg",
      link: "/services/parking"
    },
    {
      id: 5,
      title: "Приватная территория",
      description: "Гостям нашего комплекса обеспечены тишина и спокойствие на собственной приватной территории в более чем 4400 м². Многолетние ёлки и клёны, ухоженный газон, лавочки и освещение дополнят Ваше путешествие столь необходимым уютом.",
      image: "/images/services/5.jpg",
      link: "/services/private-terrace"
    },
    {
      id: 6,
      title: "Обслуживание номеров",
      description: "Поддержание чистоты и порядка в номерах является одной из основных услуг гостиницы и входит в стоимость номера. Мытье поверхностей проводится регулярно, в отсутствие или присутствие гостей.",
      image: "/images/services/6.jpg",
      link: "/services/room-service"
    },
    {
      id: 7,
      title: "Ранний заезд / поздний выезд",
      description: "При наличии свободных мест, вы сможете заселиться без предварительного бронирования на время, пока выбранные номера не станут доступны для заезда. При этом мы предлагаем почасовую модель оплаты проживания в номерах.",
      image: "/images/services/check-in/2.jpeg",
      link: "/services/check-in"
    },
    {
      id: 8,
      title: "Миграционная поддержка",
      description: "Мы понимаем, что, находясь вдали от дома, вы хотите чувствовать себя защищённо и уверенно. Именно поэтому мы предлагаем услугу миграционного учета, чтобы сделать ваше пребывание максимально легким и удобным.",
      image: "/images/services/8.jpg",
      link: "/services/migration"
    }
  ];

  export default services;