import Footer from "@/components/footer";
import FirstSection from "@/components/sections/first-section";
import Title from "@/components/ui/Title";

const TermsOfUse = () => {
  return (
    <div className="min-h-screen bg-white overflow-x-hidden max-w-[2048px] mx-auto">
      <FirstSection title="Правила использования сайта" />
      <section className="px-5 md:my-16 lg:my-[60px]">
        <div className="flex flex-col gap-8 md:gap-10 max-w-[1400px] mx-auto">
          <div className="flex flex-col gap-6 md:gap-10 max-w-[900px]">
            <Title size="medium">Пользовательское соглашение</Title>
            <p>
              Настоящее Соглашение определяет условия использования Пользователями материалов и сервисов сайта electrohotel.ru. (далее — «Сайт»).
            </p>
          </div>
        </div>
      </section>

      <section className="px-5 md:my-16 lg:my-[60px]">
        <div className="flex flex-col gap-8 md:gap-10 max-w-[1400px] mx-auto">
          <div className="flex flex-col gap-6 md:gap-10 max-w-[900px]">
            <Title size="medium">1. Общие условия</Title>
            <div className="flex flex-col gap-4">
              <p>1.1. Использование материалов и сервисов Сайта регулируется нормами действующего законодательства Российской Федерации.</p>
              <p>1.2. Сайт и все информационные материалы, каталоги, статьи и цены, размещенные на сайте, носят информационный характер и ни при каких условиях не является публичной офертой, определяемой положениями Статьи 437 (2) Гражданского кодекса РФ.</p>
              <p>1.3. Вся информация, приведенная на Сайте, может быть изменены без предварительного предупреждения. Никакое из мнений или суждений, размещенных на Сайте, не является торговой рекомендацией.</p>
              <p>1.4. Получая доступ к материалам Сайта Пользователь считается присоединившимся к настоящему Соглашению.</p>
              <p>1.5. Администрация Сайта вправе в любое время в одностороннем порядке изменять условия настоящего Соглашения. При несогласии Пользователя с внесенными изменениями он обязан отказаться от доступа к Сайту, прекратить использование материалов и сервисов Сайта.</p>
            </div>
          </div>
        </div>
      </section>

      <section className="px-5 md:my-16 lg:my-[60px]">
        <div className="flex flex-col gap-8 md:gap-10 max-w-[1400px] mx-auto">
          <div className="flex flex-col gap-6 md:gap-10 max-w-[900px]">
            <Title size="medium">2. Определения терминов</Title>
            <p>Перечисленные ниже термины имеют для целей настоящего Соглашения следующее значение:</p>
            <div className="flex flex-col gap-4">
              <p>Сайт — Интернет ресурс, расположенный на доменном имени electrohotel.ru, осуществляющий свою деятельность посредством Интернет-ресурса и сопутствующих ему сервисов.</p>
              <p>Администрация Cайта — уполномоченные сотрудники на управление Сайтом, которые организуют и (или) осуществляет обработку персональных данных, а также определяет цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.</p>
              <p>Пользователь Cайта (далее — Пользователь) — лицо, имеющее доступ к Сайту, посредством сети Интернет и использующее Сайт.</p>
            </div>
          </div>
        </div>
      </section>

      <section className="px-5 md:my-16 lg:my-[60px]">
        <div className="flex flex-col gap-8 md:gap-10 max-w-[1400px] mx-auto">
          <div className="flex flex-col gap-6 md:gap-10 max-w-[900px]">
            <Title size="medium">3. Обязательства Пользователя</Title>
            <div className="flex flex-col gap-4">
              <p>3.1. Пользователь соглашается не предпринимать действий, которые могут рассматриваться как нарушающие российское законодательство или нормы международного права, в том числе в сфере интеллектуальной собственности, авторских и/или смежных правах, а также любых действий, которые приводят или могут привести к нарушению нормальной работы Сайта и сервисов Сайта.</p>
              <p>3.2. Использование материалов Сайта без согласия Администрации Сайта не допускается (статья 1270 ГК РФ).</p>
              <p>3.3. При цитировании материалов Сайта, включая охраняемые авторские произведения, ссылка на Сайт обязательна (подпункт 1 пункта 1 статьи 1274 ГК РФ).</p>
              <p>3.4. Пользователь предупрежден о том, что Администрация Сайта не несет ответственности за посещение и использование им внешних ресурсов, ссылки на которые могут содержаться на сайте.</p>
              <p>3.5. Пользователь согласен с тем, что Администрация Сайта не несет ответственности и не имеет прямых или косвенных обязательств перед Пользователем в связи с любыми возможными или возникшими потерями или убытками, связанными с любым содержанием Сайта, товарами или услугами, доступными на или полученными через внешние сайты или ресурсы либо иные контакты Пользователя, в которые он вступил, используя размещенную на Сайте информацию или ссылки на внешние ресурсы.</p>
              <p>3.6. Регистрируясь на сайте или оставляя тем или иным способом свои персональные данные, Пользователь даёт согласие на их обработку Оператору в соответствии с Политикой в отношении обработки</p>
            </div>
          </div>
        </div>
      </section>

      <section className="px-5 md:my-16 lg:my-[60px]">
        <div className="flex flex-col gap-8 md:gap-10 max-w-[1400px] mx-auto">
          <div className="flex flex-col gap-6 md:gap-10 max-w-[900px]">
            <Title size="medium">4. Прочие условия</Title>
            <div className="flex flex-col gap-4">
              <p>4.1. Все возможные споры, вытекающие из настоящего Соглашения или связанные с ним, подлежат разрешению в соответствии с действующим законодательством Российской Федерации.</p>
              <p>4.2. Ничто в Соглашении не может пониматься как установление между Пользователем и Администрации Сайта агентских отношений, отношений товарищества, отношений по совместной деятельности, отношений личного найма, либо каких-то иных отношений, прямо не предусмотренных Соглашением.</p>
              <p>4.3. Признание судом какого-либо положения Соглашения недействительным или не подлежащим принудительному исполнению не влечет недействительности иных положений Соглашения.</p>
              <p>4.4. Бездействие со стороны Администрации Сайта в случае нарушения кем-либо из Пользователей положений Соглашения не лишает Администрацию Сайта права предпринять позднее соответствующие действия в защиту своих интересов и защиту авторских прав на охраняемые в соответствии с законодательством материалы Сайта.</p>
            </div>
            <p>Пользователь подтверждает, что ознакомлен со всеми пунктами настоящего Соглашения и безусловно принимает их.</p>
          </div>
        </div>
      </section>

      <section className="px-5 md:my-16 lg:my-[60px]">
        <div className="flex flex-col gap-8 md:gap-10 max-w-[1400px] mx-auto">
          <div className="flex flex-col gap-6 md:gap-10 max-w-[900px]">
            <Title size="medium">Оператор персональных данных:</Title>
            <p>
              ИП Матвеев Никита Андреевич
              <br />
              ИНН: 505028231762
              <br />
              ОГРНИП: 323508100674689
            </p>
          </div>
        </div>
      </section>

      <section className="px-5 md:my-16 lg:my-[60px]">
        <div className="flex flex-col gap-8 md:gap-10 max-w-[1400px] mx-auto">
          <div className="flex flex-col gap-6 md:gap-10 max-w-[900px]">
            <Title size="medium">Контактные данные:</Title>
            <p>
              UTShotel@yandex.ru
              <br />
              +7 (496) 574-42-72
              <br />
              +7 (496) 574-66-04
              <br />
              electrohotel.ru
            </p>
          </div>
        </div>
      </section>

      <Footer />
    </div>
  );
};

export default TermsOfUse;